In [1]:
import numpy as np
import pandas as pd
from pathlib import Path
import timeit
import csv

In [2]:
ch1 = '/home/student14/Documents/Python/Prenoms/Data/dpt2018.csv'
ch2 = '/home/student14/Documents/Python/Prenoms/Data/Prenoms.csv'

In [4]:
df_dpt = pd.read_csv(ch1, sep = ';', header = 0, index_col=False, names=None, na_values= ['XX', 'XXXX'])
headers = df_dpt.columns.tolist()
print(headers)

['sexe', 'preusuel', 'annais', 'dpt', 'nombre']

In [7]:
# echantillon aleatoire
# attention il vaut mieux d'avoir .copy()
df1 = df_dpt.sample(10).copy()
df1

         sexe   preusuel  annais   dpt  nombre
3329870     2      REINE  1913.0  44.0       5
186542      1   BAPTISTE  1901.0  75.0       5
3439952     2    SIMONNE  1900.0  69.0       3
2438984     2  GHISLAINE  1953.0  80.0      18
598423      1   GHISLAIN  1937.0  76.0       3
1880083     2   APOLLINE  2015.0  74.0       5
897122      1     JÉRÉMY  1998.0   3.0      10
117534      1    ANTHONY  1967.0  13.0       3
1974617     2    CAMILLE  1983.0  34.0      31
2234695     2      ELINA  2003.0  77.0       5

# iloc : selectionner par index

In [9]:
df1.iloc[0]

sexe            2
preusuel    REINE
annais       1913
dpt            44
nombre          5
Name: 3329870, dtype: object

In [11]:
df1.iloc[0, 0:2]

sexe            2
preusuel    REINE
Name: 3329870, dtype: object

In [12]:
df1.reset_index()

     index  sexe   preusuel  annais   dpt  nombre
0  3329870     2      REINE  1913.0  44.0       5
1   186542     1   BAPTISTE  1901.0  75.0       5
2  3439952     2    SIMONNE  1900.0  69.0       3
3  2438984     2  GHISLAINE  1953.0  80.0      18
4   598423     1   GHISLAIN  1937.0  76.0       3
5  1880083     2   APOLLINE  2015.0  74.0       5
6   897122     1     JÉRÉMY  1998.0   3.0      10
7   117534     1    ANTHONY  1967.0  13.0       3
8  1974617     2    CAMILLE  1983.0  34.0      31
9  2234695     2      ELINA  2003.0  77.0       5

In [14]:
df1

         sexe   preusuel  annais   dpt  nombre
3329870     2      REINE  1913.0  44.0       5
186542      1   BAPTISTE  1901.0  75.0       5
3439952     2    SIMONNE  1900.0  69.0       3
2438984     2  GHISLAINE  1953.0  80.0      18
598423      1   GHISLAIN  1937.0  76.0       3
1880083     2   APOLLINE  2015.0  74.0       5
897122      1     JÉRÉMY  1998.0   3.0      10
117534      1    ANTHONY  1967.0  13.0       3
1974617     2    CAMILLE  1983.0  34.0      31
2234695     2      ELINA  2003.0  77.0       5

In [16]:
df1.iloc[0, 2:]

annais    1913
dpt         44
nombre       5
Name: 3329870, dtype: object

In [18]:
df1.loc[117534]

sexe              1
preusuel    ANTHONY
annais         1967
dpt              13
nombre            3
Name: 117534, dtype: object

In [25]:
ind = df_dpt.set_index("preusuel")
ind.loc["YVAN", ["dpt", "nombre"]]

            dpt  nombre
preusuel
YVAN       32.0       3
YVAN       47.0       9
YVAN       51.0       3
YVAN       84.0       3
YVAN       17.0       3
...         ...     ...
YVAN      972.0       4
YVAN       59.0       3
YVAN       94.0       3
YVAN      973.0       4
YVAN        NaN    5238

[3385 rows x 2 columns]

In [40]:
df_dpt.loc[(df_dpt.annais == 1984 ) & (df_dpt.preusuel == "ELENA"), "nombre"].sum()

31